{
  "<PAD>": 0,
  "<BOS>": 1,
  "<EOS>": 2,
  "<WHITE_WINS>": 3,
  "<BLACK_WINS>": 4,
  "<DRAW>": 5,
  "B1f2": 6,
  "Ba1": 7,
  "Ba1+": 8,
  "Ba2": 9,
  "Ba2+": 10,
  "Ba3": 11,
  "Ba3#": 12,
  "Ba3+": 13,
  "Ba4": 14,
  "Ba4#": 15,
  "Ba4+": 16,
  "Ba5": 17,
  "Ba5#": 18,
  "Ba5+": 19,
  "Ba6": 20,
  "Ba6#": 21,
  "Ba6+": 22,
  "Ba7": 23,
  "Ba7+": 24,
  "Ba8": 25,
  "Bad4+": 26,
  "Bb1": 27,
  "Bb1+": 28,
  "Bb2": 29,
  "Bb2#": 30,
  "Bb2+": 31,
  "Bb3": 32,
  "Bb3#": 33,
  "Bb3+": 34,
  "Bb4": 35,
  "Bb4#": 36,
  "Bb4+": 37,
  "Bb5": 38,
  "Bb5#": 39,
  "Bb5+": 40,
  "Bb6": 41,
  "Bb6#": 42,
  "Bb6+": 43,
  "Bb7": 44,
  "Bb7#": 45,
  "Bb7+": 46,
  "Bb8": 47,
  "Bb8+": 48,
  "Bc1": 49,
  "Bc1#": 50,
  "Bc1+": 51,
  "Bc2": 52,
  "Bc2#": 53,
  "Bc2+": 54,
  "Bc3": 55,
  "Bc3#": 56,
  "Bc3+": 57,
  "Bc4": 58,
  "Bc4#": 59,
  "Bc4+": 60,
  "Bc5": 61,
  "Bc5#": 62,
  "Bc5+": 63,
  "Bc6": 64,
  "Bc6#": 65,
  "Bc6+": 66,
  "Bc7": 67,
  "Bc7#": 68,
  "Bc7+": 69,
  "Bc8": 70,
  "Bc8#": 71,
  "Bc8+": 72,
  "Bd1": 73,
  "Bd1+": 74,
  "Bd2": 75,
  "Bd2#": 76,
  "Bd2+": 77,
  "Bd3": 78,
  "Bd3#": 79,
  "Bd3+": 80,
  "Bd4": 81,
  "Bd4#": 82,
  "Bd4+": 83,
  "Bd5": 84,
  "Bd5#": 85,
  "Bd5+": 86,
  "Bd6": 87,
  "Bd6#": 88,
  "Bd6+": 89,
  "Bd7": 90,
  "Bd7#": 91,
  "Bd7+": 92,
  "Bd8": 93,
  "Bd8#": 94,
  "Bd8+": 95,
  "Bde5": 96,
  "Be1": 97,
  "Be1#": 98,
  "Be1+": 99,
  "Be2": 100,
  "Be2#": 101,
  "Be2+": 102,
  "Be3": 103,
  "Be3#": 104,
  "Be3+": 105,
  "Be4": 106,
  "Be4#": 107,
  "Be4+": 108,
  "Be5": 109,
  "Be5#": 110,
  "Be5+": 111,
  "Be6": 112,
  "Be6#": 113,
  "Be6+": 114,
  "Be7": 115,
  "Be7#": 116,
  "Be7+": 117,
  "Be8": 118,
  "Be8#": 119,
  "Be8+": 120,
  "Bed6": 121,
  "Bf1": 122,
  "Bf1#": 123,
  "Bf1+": 124,
  "Bf2": 125,
  "Bf2#": 126,
  "Bf2+": 127,
  "Bf3": 128,
  "Bf3#": 129,
  "Bf3+": 130,
  "Bf4": 131,
  "Bf4#": 132,
  "Bf4+": 133,
  "Bf5": 134,
  "Bf5#": 135,
  "Bf5+": 136,
  "Bf6": 137,
  "Bf6#": 138,
  "Bf6+": 139,
  "Bf7": 140,
  "Bf7#": 141,
  "Bf7+": 142,
  "Bf8": 143,
  "Bf8#": 144,
  "Bf8+": 145,
  "Bg1": 146,
  "Bg1+": 147,
  "Bg2": 148,
  "Bg2#": 149,
  "Bg2+": 150,
  "Bg3": 151,
  "Bg3#": 152,
  "Bg3+": 153,
  "Bg4": 154,
  "Bg4#": 155,
  "Bg4+": 156,
  "Bg5": 157,
  "Bg5#": 158,
  "Bg5+": 159,
  "Bg6": 160,
  "Bg6#": 161,
  "Bg6+": 162,
  "Bg7": 163,
  "Bg7#": 164,
  "Bg7+": 165,
  "Bg8": 166,
  "Bg8#": 167,
  "Bg8+": 168,
  "Bh1": 169,
  "Bh2": 170,
  "Bh2#": 171,
  "Bh2+": 172,
  "Bh3": 173,
  "Bh3#": 174,
  "Bh3+": 175,
  "Bh4": 176,
  "Bh4#": 177,
  "Bh4+": 178,
  "Bh5": 179,
  "Bh5#": 180,
  "Bh5+": 181,
  "Bh6": 182,
  "Bh6#": 183,
  "Bh6+": 184,
  "Bh7": 185,
  "Bh7#": 186,
  "Bh7+": 187,
  "Bh8": 188,
  "Bh8+": 189,
  "Bhe5": 190,
  "Bhg2+": 191,
  "Bxa1": 192,
  "Bxa1+": 193,
  "Bxa2": 194,
  "Bxa2#": 195,
  "Bxa2+": 196,
  "Bxa3": 197,
  "Bxa3#": 198,
  "Bxa3+": 199,
  "Bxa4": 200,
  "Bxa4+": 201,
  "Bxa5": 202,
  "Bxa5+": 203,
  "Bxa6": 204,
  "Bxa6#": 205,
  "Bxa6+": 206,
  "Bxa7": 207,
  "Bxa7+": 208,
  "Bxa8": 209,
  "Bxa8+": 210,
  "Bxb1": 211,
  "Bxb1+": 212,
  "Bxb2": 213,
  "Bxb2#": 214,
  "Bxb2+": 215,
  "Bxb3": 216,
  "Bxb3+": 217,
  "Bxb4": 218,
  "Bxb4+": 219,
  "Bxb5": 220,
  "Bxb5#": 221,
  "Bxb5+": 222,
  "Bxb6": 223,
  "Bxb6+": 224,
  "Bxb7": 225,
  "Bxb7+": 226,
  "Bxb8": 227,
  "Bxb8+": 228,
  "Bxc1": 229,
  "Bxc1+": 230,
  "Bxc2": 231,
  "Bxc2#": 232,
  "Bxc2+": 233,
  "Bxc3": 234,
  "Bxc3#": 235,
  "Bxc3+": 236,
  "Bxc4": 237,
  "Bxc4#": 238,
  "Bxc4+": 239,
  "Bxc5": 240,
  "Bxc5#": 241,
  "Bxc5+": 242,
  "Bxc6": 243,
  "Bxc6#": 244,
  "Bxc6+": 245,
  "Bxc7": 246,
  "Bxc7#": 247,
  "Bxc7+": 248,
  "Bxc8": 249,
  "Bxc8+": 250,
  "Bxd1": 251,
  "Bxd1+": 252,
  "Bxd2": 253,
  "Bxd2+": 254,
  "Bxd3": 255,
  "Bxd3#": 256,
  "Bxd3+": 257,
  "Bxd4": 258,
  "Bxd4#": 259,
  "Bxd4+": 260,
  "Bxd5": 261,
  "Bxd5#": 262,
  "Bxd5+": 263,
  "Bxd6": 264,
  "Bxd6#": 265,
  "Bxd6+": 266,
  "Bxd7": 267,
  "Bxd7#": 268,
  "Bxd7+": 269,
  "Bxd8": 270,
  "Bxd8+": 271,
  "Bxe1": 272,
  "Bxe1+": 273,
  "Bxe2": 274,
  "Bxe2#": 275,
  "Bxe2+": 276,
  "Bxe3": 277,
  "Bxe3#": 278,
  "Bxe3+": 279,
  "Bxe4": 280,
  "Bxe4#": 281,
  "Bxe4+": 282,
  "Bxe5": 283,
  "Bxe5#": 284,
  "Bxe5+": 285,
  "Bxe6": 286,
  "Bxe6#": 287,
  "Bxe6+": 288,
  "Bxe7": 289,
  "Bxe7+": 290,
  "Bxe8": 291,
  "Bxe8+": 292,
  "Bxf1": 293,
  "Bxf1#": 294,
  "Bxf1+": 295,
  "Bxf2": 296,
  "Bxf2#": 297,
  "Bxf2+": 298,
  "Bxf3": 299,
  "Bxf3#": 300,
  "Bxf3+": 301,
  "Bxf4": 302,
  "Bxf4#": 303,
  "Bxf4+": 304,
  "Bxf5": 305,
  "Bxf5#": 306,
  "Bxf5+": 307,
  "Bxf6": 308,
  "Bxf6#": 309,
  "Bxf6+": 310,
  "Bxf7": 311,
  "Bxf7#": 312,
  "Bxf7+": 313,
  "Bxf8": 314,
  "Bxf8#": 315,
  "Bxf8+": 316,
  "Bxg1": 317,
  "Bxg1+": 318,
  "Bxg2": 319,
  "Bxg2#": 320,
  "Bxg2+": 321,
  "Bxg3": 322,
  "Bxg3#": 323,
  "Bxg3+": 324,
  "Bxg4": 325,
  "Bxg4#": 326,
  "Bxg4+": 327,
  "Bxg5": 328,
  "Bxg5#": 329,
  "Bxg5+": 330,
  "Bxg6": 331,
  "Bxg6#": 332,
  "Bxg6+": 333,
  "Bxg7": 334,
  "Bxg7#": 335,
  "Bxg7+": 336,
  "Bxg8": 337,
  "Bxg8#": 338,
  "Bxg8+": 339,
  "Bxh1": 340,
  "Bxh1+": 341,
  "Bxh2": 342,
  "Bxh2+": 343,
  "Bxh3": 344,
  "Bxh3+": 345,
  "Bxh4": 346,
  "Bxh4#": 347,
  "Bxh4+": 348,
  "Bxh5": 349,
  "Bxh5+": 350,
  "Bxh6": 351,
  "Bxh6+": 352,
  "Bxh7": 353,
  "Bxh7+": 354,
  "Bxh8": 355,
  "Bxh8+": 356,
  "Ka1": 357,
  "Ka2": 358,
  "Ka3": 359,
  "Ka4": 360,
  "Ka4+": 361,
  "Ka5": 362,
  "Ka6": 363,
  "Ka7": 364,
  "Ka7+": 365,
  "Ka8": 366,
  "Kb1": 367,
  "Kb2": 368,
  "Kb2+": 369,
  "Kb3": 370,
  "Kb3+": 371,
  "Kb4": 372,
  "Kb4+": 373,
  "Kb5": 374,
  "Kb5+": 375,
  "Kb6": 376,
  "Kb6+": 377,
  "Kb7": 378,
  "Kb7+": 379,
  "Kb8": 380,
  "Kb8+": 381,
  "Kc1": 382,
  "Kc1+": 383,
  "Kc2": 384,
  "Kc2#": 385,
  "Kc2+": 386,
  "Kc3": 387,
  "Kc3+": 388,
  "Kc4": 389,
  "Kc4+": 390,
  "Kc5": 391,
  "Kc5+": 392,
  "Kc6": 393,
  "Kc6+": 394,
  "Kc7": 395,
  "Kc7+": 396,
  "Kc8": 397,
  "Kc8+": 398,
  "Kd1": 399,
  "Kd1+": 400,
  "Kd2": 401,
  "Kd2+": 402,
  "Kd3": 403,
  "Kd3+": 404,
  "Kd4": 405,
  "Kd4+": 406,
  "Kd5": 407,
  "Kd5+": 408,
  "Kd6": 409,
  "Kd6+": 410,
  "Kd7": 411,
  "Kd7+": 412,
  "Kd8": 413,
  "Ke1": 414,
  "Ke2": 415,
  "Ke2+": 416,
  "Ke3": 417,
  "Ke3+": 418,
  "Ke4": 419,
  "Ke4+": 420,
  "Ke5": 421,
  "Ke5+": 422,
  "Ke6": 423,
  "Ke6+": 424,
  "Ke7": 425,
  "Ke7+": 426,
  "Ke8": 427,
  "Ke8+": 428,
  "Kf1": 429,
  "Kf1+": 430,
  "Kf2": 431,
  "Kf2+": 432,
  "Kf3": 433,
  "Kf3+": 434,
  "Kf4": 435,
  "Kf4+": 436,
  "Kf5": 437,
  "Kf5+": 438,
  "Kf6": 439,
  "Kf6+": 440,
  "Kf7": 441,
  "Kf7+": 442,
  "Kf8": 443,
  "Kg1": 444,
  "Kg1+": 445,
  "Kg2": 446,
  "Kg2+": 447,
  "Kg3": 448,
  "Kg3+": 449,
  "Kg4": 450,
  "Kg4+": 451,
  "Kg5": 452,
  "Kg5+": 453,
  "Kg6": 454,
  "Kg6+": 455,
  "Kg7": 456,
  "Kg7+": 457,
  "Kg8": 458,
  "Kg8+": 459,
  "Kh1": 460,
  "Kh1+": 461,
  "Kh2": 462,
  "Kh2+": 463,
  "Kh3": 464,
  "Kh3+": 465,
  "Kh4": 466,
  "Kh4+": 467,
  "Kh5": 468,
  "Kh5+": 469,
  "Kh6": 470,
  "Kh7": 471,
  "Kh8": 472,
  "Kh8+": 473,
  "Kxa1": 474,
  "Kxa2": 475,
  "Kxa3": 476,
  "Kxa4": 477,
  "Kxa5": 478,
  "Kxa6": 479,
  "Kxa7": 480,
  "Kxa8": 481,
  "Kxb1": 482,
  "Kxb2": 483,
  "Kxb3": 484,
  "Kxb3+": 485,
  "Kxb4": 486,
  "Kxb5": 487,
  "Kxb6": 488,
  "Kxb6+": 489,
  "Kxb7": 490,
  "Kxb8": 491,
  "Kxc1": 492,
  "Kxc2": 493,
  "Kxc3": 494,
  "Kxc4": 495,
  "Kxc4+": 496,
  "Kxc5": 497,
  "Kxc5+": 498,
  "Kxc6": 499,
  "Kxc7": 500,
  "Kxc8": 501,
  "Kxd1": 502,
  "Kxd2": 503,
  "Kxd3": 504,
  "Kxd4": 505,
  "Kxd5": 506,
  "Kxd6": 507,
  "Kxd6+": 508,
  "Kxd7": 509,
  "Kxd8": 510,
  "Kxe1": 511,
  "Kxe1+": 512,
  "Kxe2": 513,
  "Kxe3": 514,
  "Kxe4": 515,
  "Kxe4+": 516,
  "Kxe5": 517,
  "Kxe6": 518,
  "Kxe7": 519,
  "Kxe8": 520,
  "Kxf1": 521,
  "Kxf2": 522,
  "Kxf2+": 523,
  "Kxf3": 524,
  "Kxf3+": 525,
  "Kxf4": 526,
  "Kxf5": 527,
  "Kxf5+": 528,
  "Kxf6": 529,
  "Kxf6+": 530,
  "Kxf7": 531,
  "Kxf7+": 532,
  "Kxf8": 533,
  "Kxg1": 534,
  "Kxg2": 535,
  "Kxg3": 536,
  "Kxg4": 537,
  "Kxg5": 538,
  "Kxg6": 539,
  "Kxg6+": 540,
  "Kxg7": 541,
  "Kxg8": 542,
  "Kxh1": 543,
  "Kxh2": 544,
  "Kxh3": 545,
  "Kxh4": 546,
  "Kxh5": 547,
  "Kxh6": 548,
  "Kxh7": 549,
  "Kxh8": 550,
  "N1b2": 551,
  "N1b3": 552,
  "N1c2": 553,
  "N1c3": 554,
  "N1d2": 555,
  "N1d3": 556,
  "N1e2": 557,
  "N1f2": 558,
  "N1f3": 559,
  "N1g3": 560,
  "N1h2": 561,
  "N1h3": 562,
  "N1xd2": 563,
  "N1xf3": 564,
  "N1xg3": 565,
  "N2b3": 566,
  "N2b3+": 567,
  "N2b4": 568,
  "N2c3": 569,
  "N2c4": 570,
  "N2d4": 571,
  "N2d4+": 572,
  "N2e3": 573,
  "N2e4": 574,
  "N2e4+": 575,
  "N2f3": 576,
  "N2f3+": 577,
  "N2f4": 578,
  "N2g3": 579,
  "N2g4": 580,
  "N2xc3": 581,
  "N2xd3": 582,
  "N2xe4": 583,
  "N2xe4+": 584,
  "N2xf4": 585,
  "N2xg4": 586,
  "N3a4": 587,
  "N3b4": 588,
  "N3b5": 589,
  "N3c4": 590,
  "N3c5": 591,
  "N3c5+": 592,
  "N3d2": 593,
  "N3d2+": 594,
  "N3d4": 595,
  "N3d5": 596,
  "N3e2": 597,
  "N3e4": 598,
  "N3e5": 599,
  "N3e5+": 600,
  "N3f4": 601,
  "N3f5+": 602,
  "N3g4": 603,
  "N3g5": 604,
  "N3h2": 605,
  "N3h4": 606,
  "N3h4+": 607,
  "N3xc4": 608,
  "N3xd4": 609,
  "N3xd4+": 610,
  "N3xd5": 611,
  "N3xe2": 612,
  "N3xe4": 613,
  "N3xf4": 614,
  "N3xf5": 615,
  "N3xg4": 616,
  "N3xg5": 617,
  "N4a5": 618,
  "N4a6": 619,
  "N4b3": 620,
  "N4c3": 621,
  "N4c5": 622,
  "N4c6": 623,
  "N4d3": 624,
  "N4d5": 625,
  "N4e3+": 626,
  "N4e5": 627,
  "N4e6": 628,
  "N4f3": 629,
  "N4f3+": 630,
  "N4f5": 631,
  "N4f6": 632,
  "N4g3": 633,
  "N4g5": 634,
  "N4g5+": 635,
  "N4g6": 636,
  "N4h5": 637,
  "N4h6": 638,
  "N4xa5": 639,
  "N4xb5": 640,
  "N4xc5": 641,
  "N4xc5+": 642,
  "N4xd5": 643,
  "N4xe5": 644,
  "N4xf3": 645,
  "N4xh5": 646,
  "N5a3": 647,
  "N5a4": 648,
  "N5a6": 649,
  "N5b4": 650,
  "N5b6": 651,
  "N5c3": 652,
  "N5c4": 653,
  "N5c6": 654,
  "N5c6+": 655,
  "N5d4": 656,
  "N5d4+": 657,
  "N5d6": 658,
  "N5e4": 659,
  "N5e4+": 660,
  "N5f3": 661,
  "N5f4": 662,
  "N5f6": 663,
  "N5g3": 664,
  "N5g4": 665,
  "N5g6": 666,
  "N5g6+": 667,
  "N5h3": 668,
  "N5h4": 669,
  "N5xb4": 670,
  "N5xc3": 671,
  "N5xc6": 672,
  "N5xd4": 673,
  "N5xd4+": 674,
  "N5xe4": 675,
  "N5xe6": 676,
  "N5xf4+": 677,
  "N5xf6": 678,
  "N5xg6": 679,
  "N5xh4": 680,
  "N6a5": 681,
  "N6c4": 682,
  "N6c5": 683,
  "N6d4": 684,
  "N6d4+": 685,
  "N6d5": 686,
  "N6d7": 687,
  "N6e4": 688,
  "N6e4+": 689,
  "N6e5": 690,
  "N6e7": 691,
  "N6f5": 692,
  "N6f7": 693,
  "N6g4": 694,
  "N6g5": 695,
  "N6h4": 696,
  "N6h5": 697,
  "N6h7": 698,
  "N6xa5": 699,
  "N6xb5": 700,
  "N6xc4": 701,
  "N6xc5": 702,
  "N6xd4": 703,
  "N6xd5": 704,
  "N6xd7": 705,
  "N6xe5": 706,
  "N6xf4": 707,
  "N6xg5": 708,
  "N7a6": 709,
  "N7b5": 710,
  "N7b6": 711,
  "N7c5": 712,
  "N7c6": 713,
  "N7c6+": 714,
  "N7d5": 715,
  "N7d5+": 716,
  "N7d6": 717,
  "N7e5": 718,
  "N7e6": 719,
  "N7f5": 720,
  "N7f5+": 721,
  "N7f6": 722,
  "N7f6+": 723,
  "N7g5": 724,
  "N7g6": 725,
  "N7g6+": 726,
  "N7h5": 727,
  "N7xb6": 728,
  "N7xc6": 729,
  "N7xe5": 730,
  "N7xf5": 731,
  "N7xf6": 732,
  "N7xg5+": 733,
  "N7xg6": 734,
  "N8a6": 735,
  "N8a7": 736,
  "N8b6": 737,
  "N8b7": 738,
  "N8c6": 739,
  "N8d7": 740,
  "N8d7+": 741,
  "N8e6": 742,
  "N8e6+": 743,
  "N8e7": 744,
  "N8f6": 745,
  "N8f6+": 746,
  "N8f7": 747,
  "N8g6": 748,
  "N8g6+": 749,
  "N8g7": 750,
  "N8h6": 751,
  "N8h7": 752,
  "N8xd7": 753,
  "N8xe6": 754,
  "N8xe6+": 755,
  "N8xe7": 756,
  "N8xg7": 757,
  "N8xh6": 758,
  "Na1": 759,
  "Na1+": 760,
  "Na2": 761,
  "Na2+": 762,
  "Na3": 763,
  "Na3#": 764,
  "Na3+": 765,
  "Na4": 766,
  "Na4+": 767,
  "Na5": 768,
  "Na5#": 769,
  "Na5+": 770,
  "Na6": 771,
  "Na6+": 772,
  "Na7": 773,
  "Na7#": 774,
  "Na7+": 775,
  "Na8": 776,
  "Na8#": 777,
  "Na8+": 778,
  "Nab1": 779,
  "Nab2": 780,
  "Nab3": 781,
  "Nab4": 782,
  "Nab4+": 783,
  "Nab5": 784,
  "Nab5+": 785,
  "Nab6": 786,
  "Nab8": 787,
  "Nac1": 788,
  "Nac2": 789,
  "Nac3": 790,
  "Nac3+": 791,
  "Nac4": 792,
  "Nac4+": 793,
  "Nac5": 794,
  "Nac6": 795,
  "Nac6+": 796,
  "Nac7": 797,
  "Nac8": 798,
  "Naxb2": 799,
  "Naxb3": 800,
  "Naxb3+": 801,
  "Naxb4": 802,
  "Naxb4+": 803,
  "Naxb5": 804,
  "Naxb5+": 805,
  "Naxb6": 806,
  "Naxc1": 807,
  "Naxc2": 808,
  "Naxc3": 809,
  "Naxc4": 810,
  "Naxc5": 811,
  "Naxc5+": 812,
  "Naxc6": 813,
  "Naxc8": 814,
  "Nb1": 815,
  "Nb1+": 816,
  "Nb2": 817,
  "Nb2#": 818,
  "Nb2+": 819,
  "Nb3": 820,
  "Nb3#": 821,
  "Nb3+": 822,
  "Nb4": 823,
  "Nb4#": 824,
  "Nb4+": 825,
  "Nb5": 826,
  "Nb5#": 827,
  "Nb5+": 828,
  "Nb6": 829,
  "Nb6#": 830,
  "Nb6+": 831,
  "Nb7": 832,
  "Nb7+": 833,
  "Nb8": 834,
  "Nb8#": 835,
  "Nb8+": 836,
  "Nba2": 837,
  "Nba3": 838,
  "Nba4": 839,
  "Nba5": 840,
  "Nba6": 841,
  "Nba7": 842,
  "Nba7+": 843,
  "Nba8": 844,
  "Nbc1": 845,
  "Nbc2": 846,
  "Nbc2+": 847,
  "Nbc3": 848,
  "Nbc3+": 849,
  "Nbc4": 850,
  "Nbc4+": 851,
  "Nbc5": 852,
  "Nbc5+": 853,
  "Nbc6": 854,
  "Nbc7": 855,
  "Nbc7+": 856,
  "Nbc8": 857,
  "Nbd1": 858,
  "Nbd2": 859,
  "Nbd2+": 860,
  "Nbd3": 861,
  "Nbd3+": 862,
  "Nbd4": 863,
  "Nbd4+": 864,
  "Nbd5": 865,
  "Nbd5+": 866,
  "Nbd6": 867,
  "Nbd6+": 868,
  "Nbd7": 869,
  "Nbd7+": 870,
  "Nbxa2": 871,
  "Nbxa3": 872,
  "Nbxa4": 873,
  "Nbxc2": 874,
  "Nbxc3": 875,
  "Nbxc4": 876,
  "Nbxc4+": 877,
  "Nbxc5": 878,
  "Nbxc6": 879,
  "Nbxc7+": 880,
  "Nbxd2": 881,
  "Nbxd3": 882,
  "Nbxd3+": 883,
  "Nbxd4": 884,
  "Nbxd5": 885,
  "Nbxd5+": 886,
  "Nbxd6": 887,
  "Nbxd6+": 888,
  "Nbxd7": 889,
  "Nc1": 890,
  "Nc1+": 891,
  "Nc2": 892,
  "Nc2#": 893,
  "Nc2+": 894,
  "Nc3": 895,
  "Nc3#": 896,
  "Nc3+": 897,
  "Nc4": 898,
  "Nc4#": 899,
  "Nc4+": 900,
  "Nc5": 901,
  "Nc5#": 902,
  "Nc5+": 903,
  "Nc6": 904,
  "Nc6#": 905,
  "Nc6+": 906,
  "Nc7": 907,
  "Nc7#": 908,
  "Nc7+": 909,
  "Nc8": 910,
  "Nc8+": 911,
  "Nca2+": 912,
  "Nca3": 913,
  "Nca4": 914,
  "Nca5": 915,
  "Nca6": 916,
  "Nca6+": 917,
  "Nca7": 918,
  "Ncb1": 919,
  "Ncb2": 920,
  "Ncb3": 921,
  "Ncb3+": 922,
  "Ncb4": 923,
  "Ncb5": 924,
  "Ncb6": 925,
  "Ncb6+": 926,
  "Ncb8": 927,
  "Ncd1": 928,
  "Ncd2": 929,
  "Ncd2+": 930,
  "Ncd3": 931,
  "Ncd3+": 932,
  "Ncd4": 933,
  "Ncd4+": 934,
  "Ncd5": 935,
  "Ncd5+": 936,
  "Ncd6": 937,
  "Ncd6+": 938,
  "Ncd7": 939,
  "Ncd7+": 940,
  "Ncd8": 941,
  "Nce1": 942,
  "Nce2": 943,
  "Nce2+": 944,
  "Nce3": 945,
  "Nce3+": 946,
  "Nce4": 947,
  "Nce4+": 948,
  "Nce5": 949,
  "Nce5+": 950,
  "Nce6": 951,
  "Nce6+": 952,
  "Nce7": 953,
  "Nce7+": 954,
  "Nce8": 955,
  "Ncxa2": 956,
  "Ncxa4": 957,
  "Ncxa5": 958,
  "Ncxa7": 959,
  "Ncxb1": 960,
  "Ncxb2": 961,
  "Ncxb3": 962,
  "Ncxb4": 963,
  "Ncxb4+": 964,
  "Ncxb5": 965,
  "Ncxb6": 966,
  "Ncxb7": 967,
  "Ncxb8": 968,
  "Ncxd1": 969,
  "Ncxd2": 970,
  "Ncxd3": 971,
  "Ncxd3+": 972,
  "Ncxd4": 973,
  "Ncxd5": 974,
  "Ncxd6": 975,
  "Ncxd7": 976,
  "Ncxd8": 977,
  "Ncxe2": 978,
  "Ncxe3": 979,
  "Ncxe4": 980,
  "Ncxe4+": 981,
  "Ncxe5": 982,
  "Ncxe5+": 983,
  "Ncxe6": 984,
  "Ncxe6+": 985,
  "Ncxe7": 986,
  "Ncxe7+": 987,
  "Nd1": 988,
  "Nd1#": 989,
  "Nd1+": 990,
  "Nd2": 991,
  "Nd2#": 992,
  "Nd2+": 993,
  "Nd3": 994,
  "Nd3#": 995,
  "Nd3+": 996,
  "Nd4": 997,
  "Nd4#": 998,
  "Nd4+": 999,
  "Nd5": 1000,
  "Nd5#": 1001,
  "Nd5+": 1002,
  "Nd6": 1003,
  "Nd6#": 1004,
  "Nd6+": 1005,
  "Nd7": 1006,
  "Nd7#": 1007,
  "Nd7+": 1008,
  "Nd8": 1009,
  "Nd8+": 1010,
  "Ndb1": 1011,
  "Ndb2": 1012,
  "Ndb3": 1013,
  "Ndb4": 1014,
  "Ndb5": 1015,
  "Ndb5+": 1016,
  "Ndb6": 1017,
  "Ndb6+": 1018,
  "Ndb7": 1019,
  "Ndb7+": 1020,
  "Ndb8": 1021,
  "Ndc2": 1022,
  "Ndc2+": 1023,
  "Ndc3": 1024,
  "Ndc3+": 1025,
  "Ndc4": 1026,
  "Ndc4+": 1027,
  "Ndc5": 1028,
  "Ndc5+": 1029,
  "Ndc6": 1030,
  "Ndc6+": 1031,
  "Ndc7": 1032,
  "Ndc7+": 1033,
  "Ndc8": 1034,
  "Ndc8+": 1035,
  "Nde1": 1036,
  "Nde2": 1037,
  "Nde2+": 1038,
  "Nde3": 1039,
  "Nde3+": 1040,
  "Nde4": 1041,
  "Nde4+": 1042,
  "Nde5": 1043,
  "Nde5+": 1044,
  "Nde6": 1045,
  "Nde6+": 1046,
  "Nde7": 1047,
  "Nde7+": 1048,
  "Nde8": 1049,
  "Ndf1": 1050,
  "Ndf2": 1051,
  "Ndf2+": 1052,
  "Ndf3": 1053,
  "Ndf3#": 1054,
  "Ndf3+": 1055,
  "Ndf4": 1056,
  "Ndf4+": 1057,
  "Ndf5": 1058,
  "Ndf5+": 1059,
  "Ndf6": 1060,
  "Ndf6+": 1061,
  "Ndf7": 1062,
  "Ndf7+": 1063,
  "Ndf8": 1064,
  "Ndxb1": 1065,
  "Ndxb3": 1066,
  "Ndxb4": 1067,
  "Ndxb4+": 1068,
  "Ndxb5": 1069,
  "Ndxb5+": 1070,
  "Ndxb6": 1071,
  "Ndxc2": 1072,
  "Ndxc2+": 1073,
  "Ndxc3": 1074,
  "Ndxc3+": 1075,
  "Ndxc4": 1076,
  "Ndxc4+": 1077,
  "Ndxc5": 1078,
  "Ndxc5+": 1079,
  "Ndxc6": 1080,
  "Ndxc6+": 1081,
  "Ndxc7": 1082,
  "Ndxc7+": 1083,
  "Ndxc8": 1084,
  "Ndxe2": 1085,
  "Ndxe3": 1086,
  "Ndxe4": 1087,
  "Ndxe4+": 1088,
  "Ndxe5": 1089,
  "Ndxe6": 1090,
  "Ndxe6+": 1091,
  "Ndxe7": 1092,
  "Ndxe7+": 1093,
  "Ndxe8": 1094,
  "Ndxf1": 1095,
  "Ndxf2": 1096,
  "Ndxf2+": 1097,
  "Ndxf3": 1098,
  "Ndxf3+": 1099,
  "Ndxf4": 1100,
  "Ndxf4+": 1101,
  "Ndxf5": 1102,
  "Ndxf5+": 1103,
  "Ndxf6": 1104,
  "Ndxf6+": 1105,
  "Ndxf7": 1106,
  "Ndxf7+": 1107,
  "Ndxf8": 1108,
  "Ne1": 1109,
  "Ne1+": 1110,
  "Ne2": 1111,
  "Ne2#": 1112,
  "Ne2+": 1113,
  "Ne3": 1114,
  "Ne3#": 1115,
  "Ne3+": 1116,
  "Ne4": 1117,
  "Ne4#": 1118,
  "Ne4+": 1119,
  "Ne5": 1120,
  "Ne5#": 1121,
  "Ne5+": 1122,
  "Ne6": 1123,
  "Ne6#": 1124,
  "Ne6+": 1125,
  "Ne7": 1126,
  "Ne7#": 1127,
  "Ne7+": 1128,
  "Ne8": 1129,
  "Ne8#": 1130,
  "Ne8+": 1131,
  "Nec1": 1132,
  "Nec2": 1133,
  "Nec2+": 1134,
  "Nec3": 1135,
  "Nec4": 1136,
  "Nec4+": 1137,
  "Nec5": 1138,
  "Nec5+": 1139,
  "Nec6": 1140,
  "Nec6+": 1141,
  "Nec7": 1142,
  "Nec7+": 1143,
  "Nec8": 1144,
  "Ned1": 1145,
  "Ned2": 1146,
  "Ned2+": 1147,
  "Ned3": 1148,
  "Ned3+": 1149,
  "Ned4": 1150,
  "Ned4+": 1151,
  "Ned5": 1152,
  "Ned5+": 1153,
  "Ned6": 1154,
  "Ned6+": 1155,
  "Ned7": 1156,
  "Ned7+": 1157,
  "Ned8": 1158,
  "Ned8+": 1159,
  "Nef1": 1160,
  "Nef2": 1161,
  "Nef2+": 1162,
  "Nef3": 1163,
  "Nef3+": 1164,
  "Nef4": 1165,
  "Nef4+": 1166,
  "Nef5": 1167,
  "Nef5+": 1168,
  "Nef6": 1169,
  "Nef6+": 1170,
  "Nef7": 1171,
  "Nef7+": 1172,
  "Neg1": 1173,
  "Neg2": 1174,
  "Neg3": 1175,
  "Neg3+": 1176,
  "Neg4": 1177,
  "Neg4+": 1178,
  "Neg5": 1179,
  "Neg5+": 1180,
  "Neg6": 1181,
  "Neg6+": 1182,
  "Neg7": 1183,
  "Neg8": 1184,
  "Nexc1": 1185,
  "Nexc2": 1186,
  "Nexc2+": 1187,
  "Nexc3": 1188,
  "Nexc4": 1189,
  "Nexc5": 1190,
  "Nexc6": 1191,
  "Nexc7": 1192,
  "Nexc7+": 1193,
  "Nexd2": 1194,
  "Nexd3": 1195,
  "Nexd3+": 1196,
  "Nexd4": 1197,
  "Nexd5": 1198,
  "Nexd6": 1199,
  "Nexd6+": 1200,
  "Nexd7": 1201,
  "Nexd8": 1202,
  "Nexf2": 1203,
  "Nexf2+": 1204,
  "Nexf3": 1205,
  "Nexf3+": 1206,
  "Nexf4": 1207,
  "Nexf5": 1208,
  "Nexf6": 1209,
  "Nexf6+": 1210,
  "Nexf7": 1211,
  "Nexg2": 1212,
  "Nexg3": 1213,
  "Nexg4": 1214,
  "Nexg4+": 1215,
  "Nexg5": 1216,
  "Nexg5+": 1217,
  "Nexg7": 1218,
  "Nexg7+": 1219,
  "Nf1": 1220,
  "Nf1#": 1221,
  "Nf1+": 1222,
  "Nf2": 1223,
  "Nf2#": 1224,
  "Nf2+": 1225,
  "Nf3": 1226,
  "Nf3#": 1227,
  "Nf3+": 1228,
  "Nf4": 1229,
  "Nf4#": 1230,
  "Nf4+": 1231,
  "Nf5": 1232,
  "Nf5#": 1233,
  "Nf5+": 1234,
  "Nf6": 1235,
  "Nf6#": 1236,
  "Nf6+": 1237,
  "Nf7": 1238,
  "Nf7#": 1239,
  "Nf7+": 1240,
  "Nf8": 1241,
  "Nf8#": 1242,
  "Nf8+": 1243,
  "Nfd1": 1244,
  "Nfd2": 1245,
  "Nfd2+": 1246,
  "Nfd3": 1247,
  "Nfd3+": 1248,
  "Nfd4": 1249,
  "Nfd4+": 1250,
  "Nfd5": 1251,
  "Nfd5+": 1252,
  "Nfd6": 1253,
  "Nfd6+": 1254,
  "Nfd7": 1255,
  "Nfd7+": 1256,
  "Nfd8": 1257,
  "Nfe1": 1258,
  "Nfe2": 1259,
  "Nfe2+": 1260,
  "Nfe3": 1261,
  "Nfe3+": 1262,
  "Nfe4": 1263,
  "Nfe4+": 1264,
  "Nfe5": 1265,
  "Nfe5+": 1266,
  "Nfe6": 1267,
  "Nfe6+": 1268,
  "Nfe7": 1269,
  "Nfe7+": 1270,
  "Nfe8": 1271,
  "Nfe8+": 1272,
  "Nfg1": 1273,
  "Nfg3": 1274,
  "Nfg3+": 1275,
  "Nfg4": 1276,
  "Nfg4+": 1277,
  "Nfg5": 1278,
  "Nfg5+": 1279,
  "Nfg6": 1280,
  "Nfg6+": 1281,
  "Nfg7+": 1282,
  "Nfg8": 1283,
  "Nfh2": 1284,
  "Nfh3": 1285,
  "Nfh3+": 1286,
  "Nfh4": 1287,
  "Nfh4+": 1288,
  "Nfh5": 1289,
  "Nfh6": 1290,
  "Nfh6+": 1291,
  "Nfh7": 1292,
  "Nfxd1": 1293,
  "Nfxd2": 1294,
  "Nfxd3": 1295,
  "Nfxd3+": 1296,
  "Nfxd4": 1297,
  "Nfxd4+": 1298,
  "Nfxd5": 1299,
  "Nfxd5+": 1300,
  "Nfxd6": 1301,
  "Nfxd6+": 1302,
  "Nfxd7": 1303,
  "Nfxe2+": 1304,
  "Nfxe3": 1305,
  "Nfxe4": 1306,
  "Nfxe5": 1307,
  "Nfxe5+": 1308,
  "Nfxe6": 1309,
  "Nfxe7": 1310,
  "Nfxe7+": 1311,
  "Nfxg2": 1312,
  "Nfxg3": 1313,
  "Nfxg3+": 1314,
  "Nfxg4": 1315,
  "Nfxg5": 1316,
  "Nfxg5+": 1317,
  "Nfxg6": 1318,
  "Nfxg7": 1319,
  "Nfxg8": 1320,
  "Nfxh2": 1321,
  "Nfxh4": 1322,
  "Nfxh5": 1323,
  "Nfxh7": 1324,
  "Ng1": 1325,
  "Ng1#": 1326,
  "Ng1+": 1327,
  "Ng2": 1328,
  "Ng2#": 1329,
  "Ng2+": 1330,
  "Ng3": 1331,
  "Ng3#": 1332,
  "Ng3+": 1333,
  "Ng4": 1334,
  "Ng4#": 1335,
  "Ng4+": 1336,
  "Ng5": 1337,
  "Ng5#": 1338,
  "Ng5+": 1339,
  "Ng6": 1340,
  "Ng6#": 1341,
  "Ng6+": 1342,
  "Ng7": 1343,
  "Ng7#": 1344,
  "Ng7+": 1345,
  "Ng8": 1346,
  "Ng8#": 1347,
  "Ng8+": 1348,
  "Nge1": 1349,
  "Nge1+": 1350,
  "Nge2": 1351,
  "Nge2+": 1352,
  "Nge3": 1353,
  "Nge3+": 1354,
  "Nge4": 1355,
  "Nge4+": 1356,
  "Nge5": 1357,
  "Nge5+": 1358,
  "Nge6": 1359,
  "Nge6+": 1360,
  "Nge7": 1361,
  "Nge8": 1362,
  "Ngf1": 1363,
  "Ngf2": 1364,
  "Ngf2#": 1365,
  "Ngf3": 1366,
  "Ngf3+": 1367,
  "Ngf4": 1368,
  "Ngf4+": 1369,
  "Ngf5": 1370,
  "Ngf5+": 1371,
  "Ngf6": 1372,
  "Ngf6+": 1373,
  "Ngf7": 1374,
  "Ngf7+": 1375,
  "Ngf8": 1376,
  "Ngh1": 1377,
  "Ngh2": 1378,
  "Ngh3": 1379,
  "Ngh4": 1380,
  "Ngh4+": 1381,
  "Ngh5": 1382,
  "Ngh6": 1383,
  "Ngh7": 1384,
  "Ngh7+": 1385,
  "Ngxe2": 1386,
  "Ngxe3": 1387,
  "Ngxe4": 1388,
  "Ngxe5": 1389,
  "Ngxe5+": 1390,
  "Ngxe6": 1391,
  "Ngxe6+": 1392,
  "Ngxe7": 1393,
  "Ngxe8": 1394,
  "Ngxf2": 1395,
  "Ngxf3": 1396,
  "Ngxf3+": 1397,
  "Ngxf4": 1398,
  "Ngxf4+": 1399,
  "Ngxf5": 1400,
  "Ngxf6": 1401,
  "Ngxf6+": 1402,
  "Ngxf7": 1403,
  "Ngxf7+": 1404,
  "Ngxf8": 1405,
  "Ngxh3": 1406,
  "Ngxh4": 1407,
  "Ngxh4+": 1408,
  "Ngxh6": 1409,
  "Ngxh6+": 1410,
  "Ngxh7": 1411,
  "Ngxh7+": 1412,
  "Nh1": 1413,
  "Nh1+": 1414,
  "Nh2": 1415,
  "Nh2#": 1416,
  "Nh2+": 1417,
  "Nh3": 1418,
  "Nh3#": 1419,
  "Nh3+": 1420,
  "Nh4": 1421,
  "Nh4#": 1422,
  "Nh4+": 1423,
  "Nh5": 1424,
  "Nh5#": 1425,
  "Nh5+": 1426,
  "Nh6": 1427,
  "Nh6#": 1428,
  "Nh6+": 1429,
  "Nh7": 1430,
  "Nh7#": 1431,
  "Nh7+": 1432,
  "Nh8": 1433,
  "Nh8+": 1434,
  "Nhf1": 1435,
  "Nhf2": 1436,
  "Nhf2+": 1437,
  "Nhf3": 1438,
  "Nhf3+": 1439,
  "Nhf4": 1440,
  "Nhf4+": 1441,
  "Nhf5": 1442,
  "Nhf5+": 1443,
  "Nhf6": 1444,
  "Nhf6+": 1445,
  "Nhf7": 1446,
  "Nhf7+": 1447,
  "Nhf8": 1448,
  "Nhg1": 1449,
  "Nhg2": 1450,
  "Nhg3": 1451,
  "Nhg3#": 1452,
  "Nhg3+": 1453,
  "Nhg4": 1454,
  "Nhg4+": 1455,
  "Nhg5": 1456,
  "Nhg5+": 1457,
  "Nhg6": 1458,
  "Nhg6+": 1459,
  "Nhg7": 1460,
  "Nhg8": 1461,
  "Nhxf1": 1462,
  "Nhxf2": 1463,
  "Nhxf3": 1464,
  "Nhxf3+": 1465,
  "Nhxf4": 1466,
  "Nhxf5": 1467,
  "Nhxf5+": 1468,
  "Nhxf6": 1469,
  "Nhxf6+": 1470,
  "Nhxf7": 1471,
  "Nhxf7+": 1472,
  "Nhxf8": 1473,
  "Nhxg3": 1474,
  "Nhxg4": 1475,
  "Nhxg4+": 1476,
  "Nhxg5": 1477,
  "Nhxg6": 1478,
  "Nxa1": 1479,
  "Nxa1+": 1480,
  "Nxa2": 1481,
  "Nxa2#": 1482,
  "Nxa2+": 1483,
  "Nxa3": 1484,
  "Nxa3+": 1485,
  "Nxa4": 1486,
  "Nxa4+": 1487,
  "Nxa5": 1488,
  "Nxa5+": 1489,
  "Nxa6": 1490,
  "Nxa6+": 1491,
  "Nxa7": 1492,
  "Nxa7#": 1493,
  "Nxa7+": 1494,
  "Nxa8": 1495,
  "Nxa8+": 1496,
  "Nxb1": 1497,
  "Nxb1+": 1498,
  "Nxb2": 1499,
  "Nxb2+": 1500,
  "Nxb3": 1501,
  "Nxb3#": 1502,
  "Nxb3+": 1503,
  "Nxb4": 1504,
  "Nxb4#": 1505,
  "Nxb4+": 1506,
  "Nxb5": 1507,
  "Nxb5+": 1508,
  "Nxb6": 1509,
  "Nxb6#": 1510,
  "Nxb6+": 1511,
  "Nxb7": 1512,
  "Nxb7+": 1513,
  "Nxb8": 1514,
  "Nxb8+": 1515,
  "Nxc1": 1516,
  "Nxc1+": 1517,
  "Nxc2": 1518,
  "Nxc2#": 1519,
  "Nxc2+": 1520,
  "Nxc3": 1521,
  "Nxc3#": 1522,
  "Nxc3+": 1523,
  "Nxc4": 1524,
  "Nxc4+": 1525,
  "Nxc5": 1526,
  "Nxc5#": 1527,
  "Nxc5+": 1528,
  "Nxc6": 1529,
  "Nxc6#": 1530,
  "Nxc6+": 1531,
  "Nxc7": 1532,
  "Nxc7#": 1533,
  "Nxc7+": 1534,
  "Nxc8": 1535,
  "Nxc8+": 1536,
  "Nxd1": 1537,
  "Nxd1+": 1538,
  "Nxd2": 1539,
  "Nxd2+": 1540,
  "Nxd3": 1541,
  "Nxd3#": 1542,
  "Nxd3+": 1543,
  "Nxd4": 1544,
  "Nxd4+": 1545,
  "Nxd5": 1546,
  "Nxd5+": 1547,
  "Nxd6": 1548,
  "Nxd6#": 1549,
  "Nxd6+": 1550,
  "Nxd7": 1551,
  "Nxd7#": 1552,
  "Nxd7+": 1553,
  "Nxd8": 1554,
  "Nxd8+": 1555,
  "Nxe1": 1556,
  "Nxe1+": 1557,
  "Nxe2": 1558,
  "Nxe2#": 1559,
  "Nxe2+": 1560,
  "Nxe3": 1561,
  "Nxe3#": 1562,
  "Nxe3+": 1563,
  "Nxe4": 1564,
  "Nxe4+": 1565,
  "Nxe5": 1566,
  "Nxe5#": 1567,
  "Nxe5+": 1568,
  "Nxe6": 1569,
  "Nxe6#": 1570,
  "Nxe6+": 1571,
  "Nxe7": 1572,
  "Nxe7+": 1573,
  "Nxe8": 1574,
  "Nxe8+": 1575,
  "Nxf1": 1576,
  "Nxf1+": 1577,
  "Nxf2": 1578,
  "Nxf2#": 1579,
  "Nxf2+": 1580,
  "Nxf3": 1581,
  "Nxf3#": 1582,
  "Nxf3+": 1583,
  "Nxf4": 1584,
  "Nxf4#": 1585,
  "Nxf4+": 1586,
  "Nxf5": 1587,
  "Nxf5+": 1588,
  "Nxf6": 1589,
  "Nxf6#": 1590,
  "Nxf6+": 1591,
  "Nxf7": 1592,
  "Nxf7#": 1593,
  "Nxf7+": 1594,
  "Nxf8": 1595,
  "Nxf8+": 1596,
  "Nxg1": 1597,
  "Nxg1+": 1598,
  "Nxg2": 1599,
  "Nxg2#": 1600,
  "Nxg2+": 1601,
  "Nxg3": 1602,
  "Nxg3#": 1603,
  "Nxg3+": 1604,
  "Nxg4": 1605,
  "Nxg4#": 1606,
  "Nxg4+": 1607,
  "Nxg5": 1608,
  "Nxg5#": 1609,
  "Nxg5+": 1610,
  "Nxg6": 1611,
  "Nxg6+": 1612,
  "Nxg7": 1613,
  "Nxg7+": 1614,
  "Nxg8": 1615,
  "Nxg8+": 1616,
  "Nxh1": 1617,
  "Nxh1+": 1618,
  "Nxh2": 1619,
  "Nxh2#": 1620,
  "Nxh2+": 1621,
  "Nxh3": 1622,
  "Nxh3+": 1623,
  "Nxh4": 1624,
  "Nxh4#": 1625,
  "Nxh4+": 1626,
  "Nxh5": 1627,
  "Nxh5+": 1628,
  "Nxh6": 1629,
  "Nxh6#": 1630,
  "Nxh6+": 1631,
  "Nxh7": 1632,
  "Nxh7#": 1633,
  "Nxh7+": 1634,
  "Nxh8": 1635,
  "Nxh8#": 1636,
  "Nxh8+": 1637,
  "O-O": 1638,
  "O-O+": 1639,
  "O-O-O": 1640,
  "O-O-O#": 1641,
  "O-O-O+": 1642,
  "Q1a2": 1643,
  "Q1a2#": 1644,
  "Q1a6#": 1645,
  "Q1a7+": 1646,
  "Q1d2+": 1647,
  "Q1d3": 1648,
  "Q1d3+": 1649,
  "Q1d6": 1650,
  "Q1e1+": 1651,
  "Q1e2#": 1652,
  "Q1e4+": 1653,
  "Q1e7": 1654,
  "Q1f2": 1655,
  "Q1f3#": 1656,
  "Q1f3+": 1657,
  "Q1h1#": 1658,
  "Q1h2+": 1659,
  "Q1xe2": 1660,
  "Q1xf2+": 1661,
  "Q1xg2": 1662,
  "Q2a2#": 1663,
  "Q2b2+": 1664,
  "Q2c2+": 1665,
  "Q2c4": 1666,
  "Q2c4+": 1667,
  "Q2d2": 1668,
  "Q2d5#": 1669,
  "Q2e4+": 1670,
  "Q2f4+": 1671,
  "Q2g5+": 1672,
  "Q2h4+": 1673,
  "Q2xe3": 1674,
  "Q2xe5#": 1675,
  "Q2xf2#": 1676,
  "Q3a3#": 1677,
  "Q3b3+": 1678,
  "Q3b4+": 1679,
  "Q3b6#": 1680,
  "Q3c3+": 1681,
  "Q3c4+": 1682,
  "Q3c5#": 1683,
  "Q3d2+": 1684,
  "Q3d4+": 1685,
  "Q3e2": 1686,
  "Q3e2+": 1687,
  "Q3e7": 1688,
  "Q3f5#": 1689,
  "Q3f5+": 1690,
  "Q3f7#": 1691,
  "Q3g4+": 1692,
  "Q3g7": 1693,
  "Q3h4+": 1694,
  "Q4a4+": 1695,
  "Q4b3#": 1696,
  "Q4b6+": 1697,
  "Q4c4": 1698,
  "Q4c4+": 1699,
  "Q4c5": 1700,
  "Q4c5#": 1701,
  "Q4d4+": 1702,
  "Q4d5": 1703,
  "Q4e3": 1704,
  "Q4e5": 1705,
  "Q4e6": 1706,
  "Q4e7#": 1707,
  "Q4g3#": 1708,
  "Q4g3+": 1709,
  "Q4h2+": 1710,
  "Q4h4+": 1711,
  "Q5b6#": 1712,
  "Q5c4#": 1713,
  "Q5d2#": 1714,
  "Q5d4": 1715,
  "Q5d4+": 1716,
  "Q5d5+": 1717,
  "Q5d6": 1718,
  "Q5e3+": 1719,
  "Q5e4": 1720,
  "Q5e5": 1721,
  "Q5f3#": 1722,
  "Q5g4": 1723,
  "Q5g6+": 1724,
  "Q5g7#": 1725,
  "Q5g8+": 1726,
  "Q5h4#": 1727,
  "Q5xe5+": 1728,
  "Q5xh7": 1729,
  "Q6a4+": 1730,
  "Q6b4+": 1731,
  "Q6c3#": 1732,
  "Q6c4+": 1733,
  "Q6d4+": 1734,
  "Q6e4": 1735,
  "Q6e7": 1736,
  "Q6f1": 1737,
  "Q6f3#": 1738,
  "Q6f5": 1739,
  "Q6xg6+": 1740,
  "Q7b6#": 1741,
  "Q7c5": 1742,
  "Q7c6+": 1743,
  "Q7e5": 1744,
  "Q7f7": 1745,
  "Q7h5": 1746,
  "Q7h7#": 1747,
  "Q7xf7": 1748,
  "Q7xf7#": 1749,
  "Q7xg4+": 1750,
  "Q8a6#": 1751,
  "Q8b3#": 1752,
  "Q8b7+": 1753,
  "Q8b8+": 1754,
  "Q8c6+": 1755,
  "Q8c7+": 1756,
  "Q8d4+": 1757,
  "Q8d7+": 1758,
  "Q8d8+": 1759,
  "Q8e6+": 1760,
  "Q8e7+": 1761,
  "Q8f5+": 1762,
  "Q8g5+": 1763,
  "Q8g7+": 1764,
  "Q8h7+": 1765,
  "Q8h8#": 1766,
  "Q8h8+": 1767,
  "Q8xb7+": 1768,
  "Q8xe8#": 1769,
  "Q8xh7": 1770,
  "Qa1": 1771,
  "Qa1#": 1772,
  "Qa1+": 1773,
  "Qa2": 1774,
  "Qa2#": 1775,
  "Qa2+": 1776,
  "Qa3": 1777,
  "Qa3#": 1778,
  "Qa3+": 1779,
  "Qa4": 1780,
  "Qa4#": 1781,
  "Qa4+": 1782,
  "Qa5": 1783,
  "Qa5#": 1784,
  "Qa5+": 1785,
  "Qa6": 1786,
  "Qa6#": 1787,
  "Qa6+": 1788,
  "Qa7": 1789,
  "Qa7#": 1790,
  "Qa7+": 1791,
  "Qa8": 1792,
  "Qa8#": 1793,
  "Qa8+": 1794,
  "Qaa1": 1795,
  "Qaa1#": 1796,
  "Qaa2#": 1797,
  "Qaa2+": 1798,
  "Qaa3+": 1799,
  "Qaa4#": 1800,
  "Qaa4+": 1801,
  "Qaa5+": 1802,
  "Qaa6": 1803,
  "Qaa6+": 1804,
  "Qaa7": 1805,
  "Qaa7+": 1806,
  "Qaa8": 1807,
  "Qaa8#": 1808,
  "Qab1": 1809,
  "Qab2+": 1810,
  "Qab3#": 1811,
  "Qab4": 1812,
  "Qab5+": 1813,
  "Qab6#": 1814,
  "Qab7": 1815,
  "Qab7#": 1816,
  "Qab7+": 1817,
  "Qab8+": 1818,
  "Qac1+": 1819,
  "Qac2#": 1820,
  "Qac2+": 1821,
  "Qac3": 1822,
  "Qac3#": 1823,
  "Qac3+": 1824,
  "Qac4": 1825,
  "Qac6": 1826,
  "Qac6#": 1827,
  "Qac6+": 1828,
  "Qac7": 1829,
  "Qac7+": 1830,
  "Qac8#": 1831,
  "Qac8+": 1832,
  "Qad1": 1833,
  "Qad1+": 1834,
  "Qad4": 1835,
  "Qad4#": 1836,
  "Qad4+": 1837,
  "Qad5+": 1838,
  "Qad8+": 1839,
  "Qae1": 1840,
  "Qae1+": 1841,
  "Qae4+": 1842,
  "Qae5": 1843,
  "Qae5#": 1844,
  "Qae5+": 1845,
  "Qae6#": 1846,
  "Qae7#": 1847,
  "Qae7+": 1848,
  "Qae8": 1849,
  "Qae8#": 1850,
  "Qae8+": 1851,
  "Qaf1": 1852,
  "Qaf1+": 1853,
  "Qaf3#": 1854,
  "Qaf3+": 1855,
  "Qaf4+": 1856,
  "Qaf6+": 1857,
  "Qaf8#": 1858,
  "Qaf8+": 1859,
  "Qag1": 1860,
  "Qag1#": 1861,
  "Qag1+": 1862,
  "Qag8": 1863,
  "Qag8+": 1864,
  "Qah1#": 1865,
  "Qah7#": 1866,
  "Qaxa1+": 1867,
  "Qaxa4+": 1868,
  "Qaxa5#": 1869,
  "Qaxa5+": 1870,
  "Qaxa6": 1871,
  "Qaxa7#": 1872,
  "Qaxb8": 1873,
  "Qaxc2#": 1874,
  "Qaxc3+": 1875,
  "Qaxc6+": 1876,
  "Qaxc7+": 1877,
  "Qaxd1#": 1878,
  "Qb1": 1879,
  "Qb1#": 1880,
  "Qb1+": 1881,
  "Qb2": 1882,
  "Qb2#": 1883,
  "Qb2+": 1884,
  "Qb3": 1885,
  "Qb3#": 1886,
  "Qb3+": 1887,
  "Qb4": 1888,
  "Qb4#": 1889,
  "Qb4+": 1890,
  "Qb5": 1891,
  "Qb5#": 1892,
  "Qb5+": 1893,
  "Qb6": 1894,
  "Qb6#": 1895,
  "Qb6+": 1896,
  "Qb7": 1897,
  "Qb7#": 1898,
  "Qb7+": 1899,
  "Qb8": 1900,
  "Qb8#": 1901,
  "Qb8+": 1902,
  "Qba2": 1903,
  "Qba2+": 1904,
  "Qba6+": 1905,
  "Qba8+": 1906,
  "Qbb1#": 1907,
  "Qbb1+": 1908,
  "Qbb2": 1909,
  "Qbb2#": 1910,
  "Qbb2+": 1911,
  "Qbb4#": 1912,
  "Qbb4+": 1913,
  "Qbb5": 1914,
  "Qbb5#": 1915,
  "Qbb6": 1916,
  "Qbb6+": 1917,
  "Qbb7": 1918,
  "Qbb7#": 1919,
  "Qbb7+": 1920,
  "Qbb8": 1921,
  "Qbb8#": 1922,
  "Qbb8+": 1923,
  "Qbc1": 1924,
  "Qbc1+": 1925,
  "Qbc2": 1926,
  "Qbc2+": 1927,
  "Qbc3": 1928,
  "Qbc5": 1929,
  "Qbc5+": 1930,
  "Qbc6+": 1931,
  "Qbc7": 1932,
  "Qbc7+": 1933,
  "Qbd1+": 1934,
  "Qbd2+": 1935,
  "Qbd3#": 1936,
  "Qbd3+": 1937,
  "Qbd4#": 1938,
  "Qbd6+": 1939,
  "Qbd8": 1940,
  "Qbe1": 1941,
  "Qbe1+": 1942,
  "Qbe2+": 1943,
  "Qbe3+": 1944,
  "Qbe4": 1945,
  "Qbe4+": 1946,
  "Qbe5+": 1947,
  "Qbe6#": 1948,
  "Qbe6+": 1949,
  "Qbe8+": 1950,
  "Qbf4": 1951,
  "Qbf4+": 1952,
  "Qbf6+": 1953,
  "Qbf7+": 1954,
  "Qbf8#": 1955,
  "Qbg1+": 1956,
  "Qbg3+": 1957,
  "Qbg7": 1958,
  "Qbg7#": 1959,
  "Qbg7+": 1960,
  "Qbg8": 1961,
  "Qbg8+": 1962,
  "Qbh1#": 1963,
  "Qbh2+": 1964,
  "Qbxa5": 1965,
  "Qbxb1": 1966,
  "Qbxb3+": 1967,
  "Qbxb4+": 1968,
  "Qbxc1": 1969,
  "Qbxd3": 1970,
  "Qbxd8+": 1971,
  "Qbxe3#": 1972,
  "Qbxe6#": 1973,
  "Qbxf2+": 1974,
  "Qbxf4+": 1975,
  "Qbxf6+": 1976,
  "Qbxg6+": 1977,
  "Qc1": 1978,
  "Qc1#": 1979,
  "Qc1+": 1980,
  "Qc2": 1981,
  "Qc2#": 1982,
  "Qc2+": 1983,
  "Qc3": 1984,
  "Qc3#": 1985,
  "Qc3+": 1986,
  "Qc4": 1987,
  "Qc4#": 1988,
  "Qc4+": 1989,
  "Qc5": 1990,
  "Qc5#": 1991,
  "Qc5+": 1992,
  "Qc6": 1993,
  "Qc6#": 1994,
  "Qc6+": 1995,
  "Qc7": 1996,
  "Qc7#": 1997,
  "Qc7+": 1998,
  "Qc8": 1999,
  "Qc8#": 2000,
  "Qc8+": 2001,
  "Qca1#": 2002,
  "Qca2#": 2003,
  "Qca2+": 2004,
  "Qca3": 2005,
  "Qca3#": 2006,
  "Qca4#": 2007,
  "Qca4+": 2008,
  "Qca5#": 2009,
  "Qca6#": 2010,
  "Qca7#": 2011,
  "Qca8#": 2012,
  "Qca8+": 2013,
  "Qcb2": 2014,
  "Qcb2+": 2015,
  "Qcb4#": 2016,
  "Qcb5": 2017,
  "Qcb6#": 2018,
  "Qcb6+": 2019,
  "Qcb8+": 2020,
  "Qcc1#": 2021,
  "Qcc1+": 2022,
  "Qcc2": 2023,
  "Qcc2+": 2024,
  "Qcc3": 2025,
  "Qcc3+": 2026,
  "Qcc4": 2027,
  "Qcc4+": 2028,
  "Qcc5": 2029,
  "Qcc5+": 2030,
  "Qcc6": 2031,
  "Qcc6#": 2032,
  "Qcc6+": 2033,
  "Qcc7": 2034,
  "Qcc7+": 2035,
  "Qcc8#": 2036,
  "Qcc8+": 2037,
  "Qcd1#": 2038,
  "Qcd1+": 2039,
  "Qcd2#": 2040,
  "Qcd2+": 2041,
  "Qcd3": 2042,
  "Qcd4+": 2043,
  "Qcd5+": 2044,
  "Qcd6": 2045,
  "Qcd6+": 2046,
  "Qcd7+": 2047,
  "Qcd8+": 2048,
  "Qce1": 2049,
  "Qce1#": 2050,
  "Qce1+": 2051,
  "Qce2+": 2052,
  "Qce3": 2053,
  "Qce3+": 2054,
  "Qce4#": 2055,
  "Qce5": 2056,
  "Qce5#": 2057,
  "Qce5+": 2058,
  "Qce6": 2059,
  "Qce6#": 2060,
  "Qce6+": 2061,
  "Qce7": 2062,
  "Qce7+": 2063,
  "Qce8": 2064,
  "Qce8#": 2065,
  "Qcf1": 2066,
  "Qcf1#": 2067,
  "Qcf4+": 2068,
  "Qcf5#": 2069,
  "Qcf5+": 2070,
  "Qcf8": 2071,
  "Qcg1+": 2072,
  "Qcg2+": 2073,
  "Qcg3+": 2074,
  "Qcg4": 2075,
  "Qcg4+": 2076,
  "Qcg5+": 2077,
  "Qch2": 2078,
  "Qch3#": 2079,
  "Qch5": 2080,
  "Qch5#": 2081,
  "Qch6+": 2082,
  "Qch8#": 2083,
  "Qcxb2#": 2084,
  "Qcxb6+": 2085,
  "Qcxc2#": 2086,
  "Qcxc3#": 2087,
  "Qcxc4": 2088,
  "Qcxc4+": 2089,
  "Qcxc8+": 2090,
  "Qcxe5+": 2091,
  "Qcxf2+": 2092,
  "Qcxf4+": 2093,
  "Qcxg5+": 2094,
  "Qcxh3#": 2095,
  "Qd1": 2096,
  "Qd1#": 2097,
  "Qd1+": 2098,
  "Qd2": 2099,
  "Qd2#": 2100,
  "Qd2+": 2101,
  "Qd3": 2102,
  "Qd3#": 2103,
  "Qd3+": 2104,
  "Qd4": 2105,
  "Qd4#": 2106,
  "Qd4+": 2107,
  "Qd5": 2108,
  "Qd5#": 2109,
  "Qd5+": 2110,
  "Qd6": 2111,
  "Qd6#": 2112,
  "Qd6+": 2113,
  "Qd7": 2114,
  "Qd7#": 2115,
  "Qd7+": 2116,
  "Qd8": 2117,
  "Qd8#": 2118,
  "Qd8+": 2119,
  "Qda1": 2120,
  "Qda2#": 2121,
  "Qda3+": 2122,
  "Qda4": 2123,
  "Qdb1": 2124,
  "Qdb1+": 2125,
  "Qdb2": 2126,
  "Qdb2+": 2127,
  "Qdb3": 2128,
  "Qdb3#": 2129,
  "Qdb3+": 2130,
  "Qdb4+": 2131,
  "Qdb5+": 2132,
  "Qdb6#": 2133,
  "Qdb6+": 2134,
  "Qdb7": 2135,
  "Qdb7+": 2136,
  "Qdb8+": 2137,
  "Qdc2": 2138,
  "Qdc2#": 2139,
  "Qdc3": 2140,
  "Qdc3#": 2141,
  "Qdc3+": 2142,
  "Qdc4": 2143,
  "Qdc4#": 2144,
  "Qdc4+": 2145,
  "Qdc5+": 2146,
  "Qdc6+": 2147,
  "Qdc7+": 2148,
  "Qdd1": 2149,
  "Qdd1#": 2150,
  "Qdd2": 2151,
  "Qdd2#": 2152,
  "Qdd2+": 2153,
  "Qdd3": 2154,
  "Qdd3+": 2155,
  "Qdd4": 2156,
  "Qdd4#": 2157,
  "Qdd4+": 2158,
  "Qdd5": 2159,
  "Qdd5#": 2160,
  "Qdd5+": 2161,
  "Qdd6": 2162,
  "Qdd6#": 2163,
  "Qdd6+": 2164,
  "Qdd7": 2165,
  "Qdd7#": 2166,
  "Qdd7+": 2167,
  "Qdd8#": 2168,
  "Qde1": 2169,
  "Qde1#": 2170,
  "Qde1+": 2171,
  "Qde2#": 2172,
  "Qde2+": 2173,
  "Qde3": 2174,
  "Qde3#": 2175,
  "Qde3+": 2176,
  "Qde4#": 2177,
  "Qde4+": 2178,
  "Qde5": 2179,
  "Qde6+": 2180,
  "Qde7#": 2181,
  "Qde7+": 2182,
  "Qde8#": 2183,
  "Qde8+": 2184,
  "Qdf1": 2185,
  "Qdf1+": 2186,
  "Qdf2": 2187,
  "Qdf2+": 2188,
  "Qdf3+": 2189,
  "Qdf4": 2190,
  "Qdf4+": 2191,
  "Qdf5": 2192,
  "Qdf5+": 2193,
  "Qdf6#": 2194,
  "Qdf6+": 2195,
  "Qdf7#": 2196,
  "Qdf7+": 2197,
  "Qdf8": 2198,
  "Qdf8+": 2199,
  "Qdg1": 2200,
  "Qdg1#": 2201,
  "Qdg1+": 2202,
  "Qdg2#": 2203,
  "Qdg2+": 2204,
  "Qdg3": 2205,
  "Qdg4+": 2206,
  "Qdg6": 2207,
  "Qdg6#": 2208,
  "Qdg6+": 2209,
  "Qdg7": 2210,
  "Qdg7+": 2211,
  "Qdg8#": 2212,
  "Qdh7#": 2213,
  "Qdxa5": 2214,
  "Qdxa8": 2215,
  "Qdxc2": 2216,
  "Qdxc2#": 2217,
  "Qdxc3+": 2218,
  "Qdxd1+": 2219,
  "Qdxd4+": 2220,
  "Qdxd5": 2221,
  "Qdxd7": 2222,
  "Qdxe3+": 2223,
  "Qdxe5#": 2224,
  "Qdxe6": 2225,
  "Qdxf3#": 2226,
  "Qdxf7#": 2227,
  "Qdxf8#": 2228,
  "Qdxg4#": 2229,
  "Qdxg5+": 2230,
  "Qdxh7#": 2231,
  "Qe1": 2232,
  "Qe1#": 2233,
  "Qe1+": 2234,
  "Qe2": 2235,
  "Qe2#": 2236,
  "Qe2+": 2237,
  "Qe3": 2238,
  "Qe3#": 2239,
  "Qe3+": 2240,
  "Qe4": 2241,
  "Qe4#": 2242,
  "Qe4+": 2243,
  "Qe5": 2244,
  "Qe5#": 2245,
  "Qe5+": 2246,
  "Qe6": 2247,
  "Qe6#": 2248,
  "Qe6+": 2249,
  "Qe7": 2250,
  "Qe7#": 2251,
  "Qe7+": 2252,
  "Qe8": 2253,
  "Qe8#": 2254,
  "Qe8+": 2255,
  "Qea1#": 2256,
  "Qea5#": 2257,
  "Qeb1#": 2258,
  "Qeb1+": 2259,
  "Qeb2+": 2260,
  "Qeb4+": 2261,
  "Qeb5+": 2262,
  "Qeb7+": 2263,
  "Qec1#": 2264,
  "Qec1+": 2265,
  "Qec2": 2266,
  "Qec2+": 2267,
  "Qec3+": 2268,
  "Qec4+": 2269,
  "Qec5": 2270,
  "Qec5+": 2271,
  "Qec6+": 2272,
  "Qec7+": 2273,
  "Qec8+": 2274,
  "Qed2#": 2275,
  "Qed2+": 2276,
  "Qed3": 2277,
  "Qed3+": 2278,
  "Qed4+": 2279,
  "Qed5": 2280,
  "Qed6": 2281,
  "Qed6+": 2282,
  "Qed7+": 2283,
  "Qed8+": 2284,
  "Qee1#": 2285,
  "Qee2": 2286,
  "Qee2#": 2287,
  "Qee2+": 2288,
  "Qee3": 2289,
  "Qee3#": 2290,
  "Qee3+": 2291,
  "Qee4": 2292,
  "Qee4#": 2293,
  "Qee4+": 2294,
  "Qee5": 2295,
  "Qee5+": 2296,
  "Qee6": 2297,
  "Qee6#": 2298,
  "Qee6+": 2299,
  "Qee7": 2300,
  "Qee7#": 2301,
  "Qee7+": 2302,
  "Qee8": 2303,
  "Qee8#": 2304,
  "Qef1": 2305,
  "Qef1+": 2306,
  "Qef2": 2307,
  "Qef2#": 2308,
  "Qef2+": 2309,
  "Qef3+": 2310,
  "Qef4": 2311,
  "Qef4#": 2312,
  "Qef4+": 2313,
  "Qef5": 2314,
  "Qef5#": 2315,
  "Qef6": 2316,
  "Qef7": 2317,
  "Qef7+": 2318,
  "Qef8": 2319,
  "Qef8#": 2320,
  "Qeg1+": 2321,
  "Qeg2#": 2322,
  "Qeg2+": 2323,
  "Qeg3": 2324,
  "Qeg3#": 2325,
  "Qeg3+": 2326,
  "Qeg4+": 2327,
  "Qeg5": 2328,
  "Qeg5+": 2329,
  "Qeg7": 2330,
  "Qeg7#": 2331,
  "Qeg7+": 2332,
  "Qeg8#": 2333,
  "Qeg8+": 2334,
  "Qeh1#": 2335,
  "Qeh5": 2336,
  "Qeh8#": 2337,
  "Qeh8+": 2338,
  "Qexa2#": 2339,
  "Qexa6#": 2340,
  "Qexb2#": 2341,
  "Qexc3": 2342,
  "Qexc3+": 2343,
  "Qexe4#": 2344,
  "Qexe4+": 2345,
  "Qexe5": 2346,
  "Qexe6#": 2347,
  "Qexe7#": 2348,
  "Qexf2+": 2349,
  "Qexf6+": 2350,
  "Qexf7": 2351,
  "Qexg1": 2352,
  "Qexg4": 2353,
  "Qexg5+": 2354,
  "Qexg6#": 2355,
  "Qf1": 2356,
  "Qf1#": 2357,
  "Qf1+": 2358,
  "Qf2": 2359,
  "Qf2#": 2360,
  "Qf2+": 2361,
  "Qf3": 2362,
  "Qf3#": 2363,
  "Qf3+": 2364,
  "Qf4": 2365,
  "Qf4#": 2366,
  "Qf4+": 2367,
  "Qf5": 2368,
  "Qf5#": 2369,
  "Qf5+": 2370,
  "Qf6": 2371,
  "Qf6#": 2372,
  "Qf6+": 2373,
  "Qf7": 2374,
  "Qf7#": 2375,
  "Qf7+": 2376,
  "Qf8": 2377,
  "Qf8#": 2378,
  "Qf8+": 2379,
  "Qfa1": 2380,
  "Qfa4+": 2381,
  "Qfa6#": 2382,
  "Qfa8#": 2383,
  "Qfb1#": 2384,
  "Qfb2+": 2385,
  "Qfc1": 2386,
  "Qfc3": 2387,
  "Qfc3+": 2388,
  "Qfc4": 2389,
  "Qfc4#": 2390,
  "Qfc5#": 2391,
  "Qfc5+": 2392,
  "Qfc6+": 2393,
  "Qfc8#": 2394,
  "Qfc8+": 2395,
  "Qfd1": 2396,
  "Qfd1+": 2397,
  "Qfd2": 2398,
  "Qfd2+": 2399,
  "Qfd3": 2400,
  "Qfd3#": 2401,
  "Qfd3+": 2402,
  "Qfd4+": 2403,
  "Qfd5": 2404,
  "Qfd5#": 2405,
  "Qfd5+": 2406,
  "Qfd6#": 2407,
  "Qfd6+": 2408,
  "Qfd7#": 2409,
  "Qfd7+": 2410,
  "Qfe2": 2411,
  "Qfe2#": 2412,
  "Qfe2+": 2413,
  "Qfe3": 2414,
  "Qfe3#": 2415,
  "Qfe3+": 2416,
  "Qfe4#": 2417,
  "Qfe4+": 2418,
  "Qfe5+": 2419,
  "Qfe6": 2420,
  "Qfe7": 2421,
  "Qfe7+": 2422,
  "Qfe8#": 2423,
  "Qfe8+": 2424,
  "Qff1#": 2425,
  "Qff1+": 2426,
  "Qff2": 2427,
  "Qff2#": 2428,
  "Qff2+": 2429,
  "Qff3": 2430,
  "Qff3+": 2431,
  "Qff4": 2432,
  "Qff4+": 2433,
  "Qff5": 2434,
  "Qff5+": 2435,
  "Qff6#": 2436,
  "Qff6+": 2437,
  "Qff7": 2438,
  "Qff7#": 2439,
  "Qff7+": 2440,
  "Qff8#": 2441,
  "Qfg1": 2442,
  "Qfg1+": 2443,
  "Qfg4": 2444,
  "Qfg5#": 2445,
  "Qfg5+": 2446,
  "Qfg7": 2447,
  "Qfg7+": 2448,
  "Qfh1#": 2449,
  "Qfh2": 2450,
  "Qfh2#": 2451,
  "Qfh3": 2452,
  "Qfh3#": 2453,
  "Qfh4#": 2454,
  "Qfh5+": 2455,
  "Qfh6#": 2456,
  "Qfh7#": 2457,
  "Qfh8#": 2458,
  "Qfh8+": 2459,
  "Qfxb1+": 2460,
  "Qfxd4#": 2461,
  "Qfxe6#": 2462,
  "Qfxe7": 2463,
  "Qfxf2": 2464,
  "Qfxf2+": 2465,
  "Qfxf3+": 2466,
  "Qfxf4#": 2467,
  "Qfxf4+": 2468,
  "Qfxf5+": 2469,
  "Qfxg2": 2470,
  "Qfxg3#": 2471,
  "Qfxg3+": 2472,
  "Qfxg5#": 2473,
  "Qfxg6#": 2474,
  "Qg1": 2475,
  "Qg1#": 2476,
  "Qg1+": 2477,
  "Qg2": 2478,
  "Qg2#": 2479,
  "Qg2+": 2480,
  "Qg3": 2481,
  "Qg3#": 2482,
  "Qg3+": 2483,
  "Qg4": 2484,
  "Qg4#": 2485,
  "Qg4+": 2486,
  "Qg5": 2487,
  "Qg5#": 2488,
  "Qg5+": 2489,
  "Qg6": 2490,
  "Qg6#": 2491,
  "Qg6+": 2492,
  "Qg7": 2493,
  "Qg7#": 2494,
  "Qg7+": 2495,
  "Qg8": 2496,
  "Qg8#": 2497,
  "Qg8+": 2498,
  "Qga8": 2499,
  "Qga8#": 2500,
  "Qgb1+": 2501,
  "Qgb4": 2502,
  "Qgb5+": 2503,
  "Qgb7#": 2504,
  "Qgb8#": 2505,
  "Qgb8+": 2506,
  "Qgc2+": 2507,
  "Qgc4": 2508,
  "Qgc4#": 2509,
  "Qgc5": 2510,
  "Qgc7#": 2511,
  "Qgc8+": 2512,
  "Qgd1#": 2513,
  "Qgd1+": 2514,
  "Qgd2": 2515,
  "Qgd3+": 2516,
  "Qgd5": 2517,
  "Qgd5#": 2518,
  "Qgd5+": 2519,
  "Qgd6+": 2520,
  "Qgd7#": 2521,
  "Qgd8": 2522,
  "Qgd8+": 2523,
  "Qge1": 2524,
  "Qge1+": 2525,
  "Qge2": 2526,
  "Qge2+": 2527,
  "Qge3": 2528,
  "Qge3+": 2529,
  "Qge4": 2530,
  "Qge4+": 2531,
  "Qge5+": 2532,
  "Qge6#": 2533,
  "Qge6+": 2534,
  "Qge8": 2535,
  "Qge8#": 2536,
  "Qge8+": 2537,
  "Qgf1+": 2538,
  "Qgf2": 2539,
  "Qgf2+": 2540,
  "Qgf3+": 2541,
  "Qgf5": 2542,
  "Qgf5#": 2543,
  "Qgf5+": 2544,
  "Qgf7#": 2545,
  "Qgf7+": 2546,
  "Qgg1#": 2547,
  "Qgg2": 2548,
  "Qgg2#": 2549,
  "Qgg2+": 2550,
  "Qgg3": 2551,
  "Qgg3+": 2552,
  "Qgg4": 2553,
  "Qgg4#": 2554,
  "Qgg4+": 2555,
  "Qgg5": 2556,
  "Qgg5#": 2557,
  "Qgg5+": 2558,
  "Qgg6": 2559,
  "Qgg6#": 2560,
  "Qgg6+": 2561,
  "Qgg7": 2562,
  "Qgg7#": 2563,
  "Qgg7+": 2564,
  "Qgg8#": 2565,
  "Qgh2": 2566,
  "Qgh3": 2567,
  "Qgh4+": 2568,
  "Qgh6": 2569,
  "Qgh7": 2570,
  "Qgxb3+": 2571,
  "Qgxb6#": 2572,
  "Qgxd6+": 2573,
  "Qgxf2": 2574,
  "Qgxf2#": 2575,
  "Qgxf3": 2576,
  "Qgxf7#": 2577,
  "Qgxg2#": 2578,
  "Qgxg3": 2579,
  "Qgxg6#": 2580,
  "Qgxg7+": 2581,
  "Qgxh2+": 2582,
  "Qgxh4#": 2583,
  "Qh1": 2584,
  "Qh1#": 2585,
  "Qh1+": 2586,
  "Qh2": 2587,
  "Qh2#": 2588,
  "Qh2+": 2589,
  "Qh3": 2590,
  "Qh3#": 2591,
  "Qh3+": 2592,
  "Qh4": 2593,
  "Qh4#": 2594,
  "Qh4+": 2595,
  "Qh5": 2596,
  "Qh5#": 2597,
  "Qh5+": 2598,
  "Qh6": 2599,
  "Qh6#": 2600,
  "Qh6+": 2601,
  "Qh7": 2602,
  "Qh7#": 2603,
  "Qh7+": 2604,
  "Qh8": 2605,
  "Qh8#": 2606,
  "Qh8+": 2607,
  "Qha8": 2608,
  "Qha8#": 2609,
  "Qha8+": 2610,
  "Qhb2#": 2611,
  "Qhb7": 2612,
  "Qhc1": 2613,
  "Qhc1+": 2614,
  "Qhc3+": 2615,
  "Qhc6+": 2616,
  "Qhc7#": 2617,
  "Qhc8+": 2618,
  "Qhd1": 2619,
  "Qhd1#": 2620,
  "Qhd3+": 2621,
  "Qhd4": 2622,
  "Qhd4+": 2623,
  "Qhd5": 2624,
  "Qhd5+": 2625,
  "Qhd8": 2626,
  "Qhd8+": 2627,
  "Qhe1": 2628,
  "Qhe1+": 2629,
  "Qhe2+": 2630,
  "Qhe3#": 2631,
  "Qhe3+": 2632,
  "Qhe4+": 2633,
  "Qhe5#": 2634,
  "Qhe5+": 2635,
  "Qhe8#": 2636,
  "Qhe8+": 2637,
  "Qhf1": 2638,
  "Qhf1#": 2639,
  "Qhf1+": 2640,
  "Qhf2#": 2641,
  "Qhf2+": 2642,
  "Qhf3": 2643,
  "Qhf3+": 2644,
  "Qhf5": 2645,
  "Qhf6": 2646,
  "Qhf6+": 2647,
  "Qhf8+": 2648,
  "Qhg2": 2649,
  "Qhg2+": 2650,
  "Qhg4": 2651,
  "Qhg4+": 2652,
  "Qhg5+": 2653,
  "Qhg6#": 2654,
  "Qhg7": 2655,
  "Qhg7#": 2656,
  "Qhg7+": 2657,
  "Qhg8": 2658,
  "Qhg8+": 2659,
  "Qhh1": 2660,
  "Qhh1#": 2661,
  "Qhh1+": 2662,
  "Qhh2": 2663,
  "Qhh2#": 2664,
  "Qhh2+": 2665,
  "Qhh3": 2666,
  "Qhh3+": 2667,
  "Qhh4#": 2668,
  "Qhh4+": 2669,
  "Qhh5+": 2670,
  "Qhh6#": 2671,
  "Qhh6+": 2672,
  "Qhh7": 2673,
  "Qhh7#": 2674,
  "Qhh7+": 2675,
  "Qhh8": 2676,
  "Qhxa4": 2677,
  "Qhxa8+": 2678,
  "Qhxc3+": 2679,
  "Qhxe1": 2680,
  "Qhxf6+": 2681,
  "Qhxg1#": 2682,
  "Qhxg1+": 2683,
  "Qhxg2": 2684,
  "Qhxg2#": 2685,
  "Qhxg2+": 2686,
  "Qhxg4+": 2687,
  "Qhxh2#": 2688,
  "Qhxh2+": 2689,
  "Qhxh5": 2690,
  "Qhxh7#": 2691,
  "Qxa1": 2692,
  "Qxa1#": 2693,
  "Qxa1+": 2694,
  "Qxa2": 2695,
  "Qxa2#": 2696,
  "Qxa2+": 2697,
  "Qxa3": 2698,
  "Qxa3#": 2699,
  "Qxa3+": 2700,
  "Qxa4": 2701,
  "Qxa4#": 2702,
  "Qxa4+": 2703,
  "Qxa5": 2704,
  "Qxa5#": 2705,
  "Qxa5+": 2706,
  "Qxa6": 2707,
  "Qxa6#": 2708,
  "Qxa6+": 2709,
  "Qxa7": 2710,
  "Qxa7#": 2711,
  "Qxa7+": 2712,
  "Qxa8": 2713,
  "Qxa8#": 2714,
  "Qxa8+": 2715,
  "Qxb1": 2716,
  "Qxb1#": 2717,
  "Qxb1+": 2718,
  "Qxb2": 2719,
  "Qxb2#": 2720,
  "Qxb2+": 2721,
  "Qxb3": 2722,
  "Qxb3#": 2723,
  "Qxb3+": 2724,
  "Qxb4": 2725,
  "Qxb4#": 2726,
  "Qxb4+": 2727,
  "Qxb5": 2728,
  "Qxb5#": 2729,
  "Qxb5+": 2730,
  "Qxb6": 2731,
  "Qxb6#": 2732,
  "Qxb6+": 2733,
  "Qxb7": 2734,
  "Qxb7#": 2735,
  "Qxb7+": 2736,
  "Qxb8": 2737,
  "Qxb8#": 2738,
  "Qxb8+": 2739,
  "Qxc1": 2740,
  "Qxc1#": 2741,
  "Qxc1+": 2742,
  "Qxc2": 2743,
  "Qxc2#": 2744,
  "Qxc2+": 2745,
  "Qxc3": 2746,
  "Qxc3#": 2747,
  "Qxc3+": 2748,
  "Qxc4": 2749,
  "Qxc4#": 2750,
  "Qxc4+": 2751,
  "Qxc5": 2752,
  "Qxc5#": 2753,
  "Qxc5+": 2754,
  "Qxc6": 2755,
  "Qxc6#": 2756,
  "Qxc6+": 2757,
  "Qxc7": 2758,
  "Qxc7#": 2759,
  "Qxc7+": 2760,
  "Qxc8": 2761,
  "Qxc8#": 2762,
  "Qxc8+": 2763,
  "Qxd1": 2764,
  "Qxd1#": 2765,
  "Qxd1+": 2766,
  "Qxd2": 2767,
  "Qxd2#": 2768,
  "Qxd2+": 2769,
  "Qxd3": 2770,
  "Qxd3#": 2771,
  "Qxd3+": 2772,
  "Qxd4": 2773,
  "Qxd4#": 2774,
  "Qxd4+": 2775,
  "Qxd5": 2776,
  "Qxd5#": 2777,
  "Qxd5+": 2778,
  "Qxd6": 2779,
  "Qxd6#": 2780,
  "Qxd6+": 2781,
  "Qxd7": 2782,
  "Qxd7#": 2783,
  "Qxd7+": 2784,
  "Qxd8": 2785,
  "Qxd8#": 2786,
  "Qxd8+": 2787,
  "Qxe1": 2788,
  "Qxe1#": 2789,
  "Qxe1+": 2790,
  "Qxe2": 2791,
  "Qxe2#": 2792,
  "Qxe2+": 2793,
  "Qxe3": 2794,
  "Qxe3#": 2795,
  "Qxe3+": 2796,
  "Qxe4": 2797,
  "Qxe4#": 2798,
  "Qxe4+": 2799,
  "Qxe5": 2800,
  "Qxe5#": 2801,
  "Qxe5+": 2802,
  "Qxe6": 2803,
  "Qxe6#": 2804,
  "Qxe6+": 2805,
  "Qxe7": 2806,
  "Qxe7#": 2807,
  "Qxe7+": 2808,
  "Qxe8": 2809,
  "Qxe8#": 2810,
  "Qxe8+": 2811,
  "Qxf1": 2812,
  "Qxf1#": 2813,
  "Qxf1+": 2814,
  "Qxf2": 2815,
  "Qxf2#": 2816,
  "Qxf2+": 2817,
  "Qxf3": 2818,
  "Qxf3#": 2819,
  "Qxf3+": 2820,
  "Qxf4": 2821,
  "Qxf4#": 2822,
  "Qxf4+": 2823,
  "Qxf5": 2824,
  "Qxf5#": 2825,
  "Qxf5+": 2826,
  "Qxf6": 2827,
  "Qxf6#": 2828,
  "Qxf6+": 2829,
  "Qxf7": 2830,
  "Qxf7#": 2831,
  "Qxf7+": 2832,
  "Qxf8": 2833,
  "Qxf8#": 2834,
  "Qxf8+": 2835,
  "Qxg1": 2836,
  "Qxg1#": 2837,
  "Qxg1+": 2838,
  "Qxg2": 2839,
  "Qxg2#": 2840,
  "Qxg2+": 2841,
  "Qxg3": 2842,
  "Qxg3#": 2843,
  "Qxg3+": 2844,
  "Qxg4": 2845,
  "Qxg4#": 2846,
  "Qxg4+": 2847,
  "Qxg5": 2848,
  "Qxg5#": 2849,
  "Qxg5+": 2850,
  "Qxg6": 2851,
  "Qxg6#": 2852,
  "Qxg6+": 2853,
  "Qxg7": 2854,
  "Qxg7#": 2855,
  "Qxg7+": 2856,
  "Qxg8": 2857,
  "Qxg8#": 2858,
  "Qxg8+": 2859,
  "Qxh1": 2860,
  "Qxh1#": 2861,
  "Qxh1+": 2862,
  "Qxh2": 2863,
  "Qxh2#": 2864,
  "Qxh2+": 2865,
  "Qxh3": 2866,
  "Qxh3#": 2867,
  "Qxh3+": 2868,
  "Qxh4": 2869,
  "Qxh4#": 2870,
  "Qxh4+": 2871,
  "Qxh5": 2872,
  "Qxh5#": 2873,
  "Qxh5+": 2874,
  "Qxh6": 2875,
  "Qxh6#": 2876,
  "Qxh6+": 2877,
  "Qxh7": 2878,
  "Qxh7#": 2879,
  "Qxh7+": 2880,
  "Qxh8": 2881,
  "Qxh8#": 2882,
  "Qxh8+": 2883,
  "R1a2": 2884,
  "R1a2+": 2885,
  "R1a3": 2886,
  "R1a3+": 2887,
  "R1a4": 2888,
  "R1a4+": 2889,
  "R1a5": 2890,
  "R1a6": 2891,
  "R1a6+": 2892,
  "R1a7": 2893,
  "R1a7#": 2894,
  "R1a7+": 2895,
  "R1b2": 2896,
  "R1b2+": 2897,
  "R1b3": 2898,
  "R1b3#": 2899,
  "R1b3+": 2900,
  "R1b4": 2901,
  "R1b5": 2902,
  "R1b6": 2903,
  "R1b6+": 2904,
  "R1b7": 2905,
  "R1b7#": 2906,
  "R1b7+": 2907,
  "R1c2": 2908,
  "R1c2+": 2909,
  "R1c3": 2910,
  "R1c3+": 2911,
  "R1c4": 2912,
  "R1c5": 2913,
  "R1c5#": 2914,
  "R1c6": 2915,
  "R1c6#": 2916,
  "R1c6+": 2917,
  "R1c7": 2918,
  "R1c7#": 2919,
  "R1c7+": 2920,
  "R1d2": 2921,
  "R1d2+": 2922,
  "R1d3": 2923,
  "R1d3+": 2924,
  "R1d4": 2925,
  "R1d4#": 2926,
  "R1d4+": 2927,
  "R1d5": 2928,
  "R1d5+": 2929,
  "R1d6": 2930,
  "R1d6#": 2931,
  "R1d6+": 2932,
  "R1d7": 2933,
  "R1d7#": 2934,
  "R1d7+": 2935,
  "R1e2": 2936,
  "R1e2+": 2937,
  "R1e3": 2938,
  "R1e3+": 2939,
  "R1e4": 2940,
  "R1e4#": 2941,
  "R1e4+": 2942,
  "R1e5": 2943,
  "R1e5+": 2944,
  "R1e6": 2945,
  "R1e6+": 2946,
  "R1e7": 2947,
  "R1e7#": 2948,
  "R1e7+": 2949,
  "R1f2": 2950,
  "R1f2+": 2951,
  "R1f3": 2952,
  "R1f3#": 2953,
  "R1f3+": 2954,
  "R1f4": 2955,
  "R1f5": 2956,
  "R1f5#": 2957,
  "R1f6": 2958,
  "R1f6#": 2959,
  "R1f6+": 2960,
  "R1f7": 2961,
  "R1f7+": 2962,
  "R1g2": 2963,
  "R1g2+": 2964,
  "R1g3": 2965,
  "R1g4": 2966,
  "R1g5": 2967,
  "R1g6": 2968,
  "R1g6#": 2969,
  "R1g6+": 2970,
  "R1g7#": 2971,
  "R1g7+": 2972,
  "R1h2": 2973,
  "R1h2+": 2974,
  "R1h3": 2975,
  "R1h4": 2976,
  "R1h5": 2977,
  "R1h6": 2978,
  "R1h6#": 2979,
  "R1h6+": 2980,
  "R1h7": 2981,
  "R1h7#": 2982,
  "R1h7+": 2983,
  "R1xa2": 2984,
  "R1xa2+": 2985,
  "R1xa3": 2986,
  "R1xa4": 2987,
  "R1xa6": 2988,
  "R1xb2": 2989,
  "R1xb3": 2990,
  "R1xb4": 2991,
  "R1xb5": 2992,
  "R1xc2": 2993,
  "R1xc3": 2994,
  "R1xc4": 2995,
  "R1xc5": 2996,
  "R1xc6": 2997,
  "R1xd2": 2998,
  "R1xd3": 2999,
  "R1xd4": 3000,
  "R1xd4+": 3001,
  "R1xd6": 3002,
  "R1xe2": 3003,
  "R1xe3": 3004,
  "R1xe4": 3005,
  "R1xe5": 3006,
  "R1xe6": 3007,
  "R1xf2": 3008,
  "R1xf2+": 3009,
  "R1xf3": 3010,
  "R1xf4": 3011,
  "R1xf5": 3012,
  "R1xf6": 3013,
  "R1xf6+": 3014,
  "R1xg2": 3015,
  "R1xg4": 3016,
  "R1xg6": 3017,
  "R1xh2": 3018,
  "R1xh4": 3019,
  "R2a3": 3020,
  "R2a3+": 3021,
  "R2a4": 3022,
  "R2a5": 3023,
  "R2a6": 3024,
  "R2a7": 3025,
  "R2b3": 3026,
  "R2b3+": 3027,
  "R2b4": 3028,
  "R2b5": 3029,
  "R2b6": 3030,
  "R2b7": 3031,
  "R2b7+": 3032,
  "R2c3": 3033,
  "R2c3+": 3034,
  "R2c4": 3035,
  "R2c4+": 3036,
  "R2c5": 3037,
  "R2c5+": 3038,
  "R2c6": 3039,
  "R2c7": 3040,
  "R2c7+": 3041,
  "R2d3": 3042,
  "R2d3+": 3043,
  "R2d4": 3044,
  "R2d4+": 3045,
  "R2d5": 3046,
  "R2d5#": 3047,
  "R2d6": 3048,
  "R2d6+": 3049,
  "R2d7": 3050,
  "R2d7+": 3051,
  "R2e3": 3052,
  "R2e3+": 3053,
  "R2e4": 3054,
  "R2e4#": 3055,
  "R2e4+": 3056,
  "R2e5": 3057,
  "R2e6": 3058,
  "R2e7": 3059,
  "R2e7+": 3060,
  "R2f3": 3061,
  "R2f3+": 3062,
  "R2f4": 3063,
  "R2f4+": 3064,
  "R2f5": 3065,
  "R2f6": 3066,
  "R2f7": 3067,
  "R2g3": 3068,
  "R2g3+": 3069,
  "R2g4": 3070,
  "R2g5": 3071,
  "R2g5#": 3072,
  "R2g6": 3073,
  "R2g6+": 3074,
  "R2g7": 3075,
  "R2h3": 3076,
  "R2h3+": 3077,
  "R2h5": 3078,
  "R2h6": 3079,
  "R2h6+": 3080,
  "R2h7": 3081,
  "R2xa3": 3082,
  "R2xa4": 3083,
  "R2xa7": 3084,
  "R2xb3": 3085,
  "R2xb3+": 3086,
  "R2xb4": 3087,
  "R2xb5": 3088,
  "R2xc3": 3089,
  "R2xc4": 3090,
  "R2xc5": 3091,
  "R2xc6": 3092,
  "R2xc7": 3093,
  "R2xd3": 3094,
  "R2xd5": 3095,
  "R2xe3": 3096,
  "R2xe6": 3097,
  "R2xe7": 3098,
  "R2xf3": 3099,
